; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob13) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 hoist13 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate12)
	(at pallet1 depot1)
	(clear crate9)
	(at pallet2 depot2)
	(clear crate7)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear crate8)
	(at pallet5 distributor2)
	(clear crate2)
	(at pallet6 distributor2)
	(clear crate11)
	(at truck0 depot0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 396)
	(at truck1 depot0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 209)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor2)
	(available hoist6)
	(at hoist7 depot2)
	(available hoist7)
	(at hoist8 depot1)
	(available hoist8)
	(at hoist9 distributor2)
	(available hoist9)
	(at hoist10 depot0)
	(available hoist10)
	(at hoist11 distributor1)
	(available hoist11)
	(at hoist12 depot0)
	(available hoist12)
	(at hoist13 distributor2)
	(available hoist13)
	(at crate0 distributor2)
	(on crate0 pallet6)
	(= (weight crate0) 29)
	(at crate1 distributor2)
	(on crate1 pallet5)
	(= (weight crate1) 70)
	(at crate2 distributor2)
	(on crate2 crate1)
	(= (weight crate2) 17)
	(at crate3 depot2)
	(on crate3 pallet2)
	(= (weight crate3) 26)
	(at crate4 depot0)
	(on crate4 pallet0)
	(= (weight crate4) 66)
	(at crate5 depot0)
	(on crate5 crate4)
	(= (weight crate5) 74)
	(at crate6 distributor1)
	(on crate6 pallet4)
	(= (weight crate6) 27)
	(at crate7 depot2)
	(on crate7 crate3)
	(= (weight crate7) 98)
	(at crate8 distributor1)
	(on crate8 crate6)
	(= (weight crate8) 75)
	(at crate9 depot1)
	(on crate9 pallet1)
	(= (weight crate9) 17)
	(at crate10 depot0)
	(on crate10 crate5)
	(= (weight crate10) 66)
	(at crate11 distributor2)
	(on crate11 crate0)
	(= (weight crate11) 11)
	(at crate12 depot0)
	(on crate12 crate10)
	(= (weight crate12) 3)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate5)
		(on crate1 pallet4)
		(on crate3 pallet1)
		(on crate4 pallet0)
		(on crate5 crate3)
		(on crate6 crate1)
		(on crate7 crate0)
		(on crate8 crate4)
		(on crate10 pallet5)
		(on crate12 pallet3)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist2 crate7 crate3 depot2)
   deleted: (at crate7 depot2) (clear crate7) (available hoist2) (on crate7 crate3)
   added: (lifting hoist2 crate7) (clear crate3)
   changed: (fuel-cost) from 0 to 1
   goals met: 1 of 10
2. (lift hoist11 crate8 crate6 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist11) (on crate8 crate6)
   added: (lifting hoist11 crate8) (clear crate6)
   changed: (fuel-cost) from 1 to 2
   goals met: 1 of 10
3. (lift hoist8 crate9 pallet1 depot1)
   deleted: (at crate9 depot1) (clear crate9) (available hoist8) (on crate9 pallet1)
   added: (lifting hoist8 crate9) (clear pallet1)
   changed: (fuel-cost) from 2 to 3
   goals met: 1 of 10
4. (lift hoist13 crate2 crate1 distributor2)
   deleted: (at crate2 distributor2) (clear crate2) (available hoist13) (on crate2 crate1)
   added: (lifting hoist13 crate2) (clear crate1)
   changed: (fuel-cost) from 3 to 4
   goals met: 1 of 10
5. (lift hoist9 crate11 crate0 distributor2)
   deleted: (at crate11 distributor2) (clear crate11) (available hoist9) (on crate11 crate0)
   added: (lifting hoist9 crate11) (clear crate0)
   changed: (fuel-cost) from 4 to 5
   goals met: 1 of 10
6. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 5 to 15
   goals met: 1 of 10
7. (load hoist2 crate7 truck0 depot2)
   deleted: (lifting hoist2 crate7)
   added: (in crate7 truck0) (available hoist2)
   changed: (current_load truck0) from 0 to 98
   goals met: 1 of 10
8. (lift hoist0 crate12 crate10 depot0)
   deleted: (at crate12 depot0) (clear crate12) (available hoist0) (on crate12 crate10)
   added: (lifting hoist0 crate12) (clear crate10)
   changed: (fuel-cost) from 15 to 16
   goals met: 1 of 10
9. (load hoist0 crate12 truck1 depot0)
   deleted: (lifting hoist0 crate12)
   added: (in crate12 truck1) (available hoist0)
   changed: (current_load truck1) from 0 to 3
   goals met: 1 of 10
10. (lift hoist10 crate10 crate5 depot0)
   deleted: (at crate10 depot0) (clear crate10) (available hoist10) (on crate10 crate5)
   added: (lifting hoist10 crate10) (clear crate5)
   changed: (fuel-cost) from 16 to 17
   goals met: 1 of 10
11. (drive truck1 depot0 distributor2)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor2)
   changed: (fuel-cost) from 17 to 27
   goals met: 1 of 10
12. (drive truck1 distributor2 distributor0)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 27 to 37
   goals met: 1 of 10
13. (unload hoist3 crate12 truck1 distributor0)
   deleted: (in crate12 truck1) (available hoist3)
   added: (lifting hoist3 crate12)
   changed: (current_load truck1) from 3 to 0
   goals met: 1 of 10
14. (drop hoist3 crate12 pallet3 distributor0)
   deleted: (lifting hoist3 crate12) (clear pallet3)
   added: (available hoist3) (at crate12 distributor0) (clear crate12) (on crate12 pallet3)
   goals met: 2 of 10
15. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 37 to 47
   goals met: 2 of 10
16. (load hoist11 crate8 truck0 distributor1)
   deleted: (lifting hoist11 crate8)
   added: (in crate8 truck0) (available hoist11)
   changed: (current_load truck0) from 98 to 173
   goals met: 2 of 10
17. (lift hoist11 crate6 pallet4 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist11) (on crate6 pallet4)
   added: (lifting hoist11 crate6) (clear pallet4)
   changed: (fuel-cost) from 47 to 48
   goals met: 2 of 10
18. (load hoist11 crate6 truck0 distributor1)
   deleted: (lifting hoist11 crate6)
   added: (in crate6 truck0) (available hoist11)
   changed: (current_load truck0) from 173 to 200
   goals met: 2 of 10
19. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 48 to 58
   goals met: 2 of 10
20. (load hoist10 crate10 truck0 depot0)
   deleted: (lifting hoist10 crate10)
   added: (in crate10 truck0) (available hoist10)
   changed: (current_load truck0) from 200 to 266
   goals met: 2 of 10
21. (lift hoist12 crate5 crate4 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist12) (on crate5 crate4)
   added: (lifting hoist12 crate5) (clear crate4)
   changed: (fuel-cost) from 58 to 59
   goals met: 2 of 10
22. (unload hoist0 crate8 truck0 depot0)
   deleted: (in crate8 truck0) (available hoist0)
   added: (lifting hoist0 crate8)
   changed: (current_load truck0) from 266 to 191
   goals met: 2 of 10
23. (drop hoist0 crate8 crate4 depot0)
   deleted: (lifting hoist0 crate8) (clear crate4)
   added: (available hoist0) (at crate8 depot0) (clear crate8) (on crate8 crate4)
   goals met: 3 of 10
24. (load hoist12 crate5 truck0 depot0)
   deleted: (lifting hoist12 crate5)
   added: (in crate5 truck0) (available hoist12)
   changed: (current_load truck0) from 191 to 265
   goals met: 3 of 10
25. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 59 to 69
   goals met: 3 of 10
26. (unload hoist5 crate6 truck0 distributor2)
   deleted: (in crate6 truck0) (available hoist5)
   added: (lifting hoist5 crate6)
   changed: (current_load truck0) from 265 to 238
   goals met: 3 of 10
27. (unload hoist6 crate7 truck0 distributor2)
   deleted: (in crate7 truck0) (available hoist6)
   added: (lifting hoist6 crate7)
   changed: (current_load truck0) from 238 to 140
   goals met: 3 of 10
28. (drop hoist5 crate6 crate1 distributor2)
   deleted: (lifting hoist5 crate6) (clear crate1)
   added: (available hoist5) (at crate6 distributor2) (clear crate6) (on crate6 crate1)
   goals met: 4 of 10
29. (drop hoist6 crate7 crate0 distributor2)
   deleted: (lifting hoist6 crate7) (clear crate0)
   added: (available hoist6) (at crate7 distributor2) (clear crate7) (on crate7 crate0)
   goals met: 5 of 10
30. (unload hoist5 crate10 truck0 distributor2)
   deleted: (in crate10 truck0) (available hoist5)
   added: (lifting hoist5 crate10)
   changed: (current_load truck0) from 140 to 74
   goals met: 5 of 10
31. (lift hoist7 crate3 pallet2 depot2)
   deleted: (at crate3 depot2) (clear crate3) (available hoist7) (on crate3 pallet2)
   added: (lifting hoist7 crate3) (clear pallet2)
   changed: (fuel-cost) from 69 to 70
   goals met: 5 of 10
32. (drive truck0 distributor2 depot2)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 70 to 80
   goals met: 5 of 10
33. (load hoist7 crate3 truck0 depot2)
   deleted: (lifting hoist7 crate3)
   added: (in crate3 truck0) (available hoist7)
   changed: (current_load truck0) from 74 to 100
   goals met: 5 of 10
34. (drive truck0 depot2 depot1)
   deleted: (at truck0 depot2)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 80 to 90
   goals met: 5 of 10
35. (unload hoist1 crate3 truck0 depot1)
   deleted: (in crate3 truck0) (available hoist1)
   added: (lifting hoist1 crate3)
   changed: (current_load truck0) from 100 to 74
   goals met: 5 of 10
36. (drop hoist1 crate3 pallet1 depot1)
   deleted: (lifting hoist1 crate3) (clear pallet1)
   added: (available hoist1) (at crate3 depot1) (clear crate3) (on crate3 pallet1)
   goals met: 6 of 10
37. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 90 to 100
   goals met: 6 of 10
38. (lift hoist6 crate7 crate0 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist6) (on crate7 crate0)
   added: (lifting hoist6 crate7) (clear crate0)
   changed: (fuel-cost) from 100 to 101
   goals met: 5 of 10
39. (load hoist5 crate10 truck0 distributor2)
   deleted: (lifting hoist5 crate10)
   added: (in crate10 truck0) (available hoist5)
   changed: (current_load truck0) from 74 to 140
   goals met: 5 of 10
40. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 101 to 111
   goals met: 5 of 10
41. (unload hoist1 crate5 truck0 depot1)
   deleted: (in crate5 truck0) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck0) from 140 to 66
   goals met: 5 of 10
42. (drop hoist1 crate5 crate3 depot1)
   deleted: (lifting hoist1 crate5) (clear crate3)
   added: (available hoist1) (at crate5 depot1) (clear crate5) (on crate5 crate3)
   goals met: 6 of 10
43. (load hoist8 crate9 truck0 depot1)
   deleted: (lifting hoist8 crate9)
   added: (in crate9 truck0) (available hoist8)
   changed: (current_load truck0) from 66 to 83
   goals met: 6 of 10
44. (lift hoist5 crate0 pallet6 distributor2)
   deleted: (at crate0 distributor2) (clear crate0) (available hoist5) (on crate0 pallet6)
   added: (lifting hoist5 crate0) (clear pallet6)
   changed: (fuel-cost) from 111 to 112
   goals met: 6 of 10
45. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 112 to 122
   goals met: 6 of 10
46. (load hoist5 crate0 truck0 distributor2)
   deleted: (lifting hoist5 crate0)
   added: (in crate0 truck0) (available hoist5)
   changed: (current_load truck0) from 83 to 112
   goals met: 6 of 10
47. (load hoist6 crate7 truck0 distributor2)
   deleted: (lifting hoist6 crate7)
   added: (in crate7 truck0) (available hoist6)
   changed: (current_load truck0) from 112 to 210
   goals met: 6 of 10
48. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 122 to 132
   goals met: 6 of 10
49. (unload hoist8 crate0 truck0 depot1)
   deleted: (in crate0 truck0) (available hoist8)
   added: (lifting hoist8 crate0)
   changed: (current_load truck0) from 210 to 181
   goals met: 6 of 10
50. (drop hoist8 crate0 crate5 depot1)
   deleted: (lifting hoist8 crate0) (clear crate5)
   added: (available hoist8) (at crate0 depot1) (clear crate0) (on crate0 crate5)
   goals met: 7 of 10
51. (unload hoist1 crate7 truck0 depot1)
   deleted: (in crate7 truck0) (available hoist1)
   added: (lifting hoist1 crate7)
   changed: (current_load truck0) from 181 to 83
   goals met: 7 of 10
52. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 132 to 142
   goals met: 7 of 10
53. (unload hoist5 crate10 truck0 distributor2)
   deleted: (in crate10 truck0) (available hoist5)
   added: (lifting hoist5 crate10)
   changed: (current_load truck0) from 83 to 17
   goals met: 7 of 10
54. (drop hoist1 crate7 crate0 depot1)
   deleted: (lifting hoist1 crate7) (clear crate0)
   added: (available hoist1) (at crate7 depot1) (clear crate7) (on crate7 crate0)
   goals met: 8 of 10
55. (lift hoist6 crate6 crate1 distributor2)
   deleted: (at crate6 distributor2) (clear crate6) (available hoist6) (on crate6 crate1)
   added: (lifting hoist6 crate6) (clear crate1)
   changed: (fuel-cost) from 142 to 143
   goals met: 7 of 10
56. (load hoist6 crate6 truck0 distributor2)
   deleted: (lifting hoist6 crate6)
   added: (in crate6 truck0) (available hoist6)
   changed: (current_load truck0) from 17 to 44
   goals met: 7 of 10
57. (lift hoist6 crate1 pallet5 distributor2)
   deleted: (at crate1 distributor2) (clear crate1) (available hoist6) (on crate1 pallet5)
   added: (lifting hoist6 crate1) (clear pallet5)
   changed: (fuel-cost) from 143 to 144
   goals met: 7 of 10
58. (load hoist6 crate1 truck0 distributor2)
   deleted: (lifting hoist6 crate1)
   added: (in crate1 truck0) (available hoist6)
   changed: (current_load truck0) from 44 to 114
   goals met: 7 of 10
59. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 144 to 154
   goals met: 7 of 10
60. (unload hoist4 crate1 truck0 distributor1)
   deleted: (in crate1 truck0) (available hoist4)
   added: (lifting hoist4 crate1)
   changed: (current_load truck0) from 114 to 44
   goals met: 7 of 10
61. (drop hoist4 crate1 pallet4 distributor1)
   deleted: (lifting hoist4 crate1) (clear pallet4)
   added: (available hoist4) (at crate1 distributor1) (clear crate1) (on crate1 pallet4)
   goals met: 8 of 10
62. (unload hoist4 crate6 truck0 distributor1)
   deleted: (in crate6 truck0) (available hoist4)
   added: (lifting hoist4 crate6)
   changed: (current_load truck0) from 44 to 17
   goals met: 8 of 10
63. (drop hoist4 crate6 crate1 distributor1)
   deleted: (lifting hoist4 crate6) (clear crate1)
   added: (available hoist4) (at crate6 distributor1) (clear crate6) (on crate6 crate1)
   goals met: 9 of 10
64. (drop hoist5 crate10 pallet5 distributor2)
   deleted: (lifting hoist5 crate10) (clear pallet5)
   added: (available hoist5) (at crate10 distributor2) (clear crate10) (on crate10 pallet5)
   goals met: 10 of 10
